12/data/attachments/1637881361e70228.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Lindsey_two_Friend_57997_6</nif:username>
            <nif:friendToBeRequested>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>